src/main/test/supply-chain/4-Finalization/0-Apply Tax/0-Tax Registration Number/4-TC02.02.03_41_TaxRepresentative_TRN/9-TC02.02.03_41_TaxRepresentative_TRN_2.3_apply_NetAmount/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <!--Optional:-->
         <arg0><DocumentId>
    <SystemSourceId>ICI001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CustomField1</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <GrossPriceCalculation>N</GrossPriceCalculation>
  <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
	<GrossPriceCountry></GrossPriceCountry>
    <SellerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </SellerTaxTotal>
    <BuyerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </BuyerTaxTotal>
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
      	<SellerLocalTaxCurrencyExchangeRate>2.01</SellerLocalTaxCurrencyExchangeRate>
      	<SellerLocalTaxCurrencyCode>CNY</SellerLocalTaxCurrencyCode>
      
	<BuyerLocalTaxCurrencyExchangeRate/>
      
	<BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel/>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>10200000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.0</NetAmount>
      <ItemNetAmount></ItemNetAmount>
			  <GrossAmount></GrossAmount>
			  <ItemGrossAmount></ItemGrossAmount>
			  <Quantity></Quantity>
		      <SellerTax>
		        <SellerTaxCountry>
		          <TaxCalculationLineComponent>
		            <TaxAmount/>
					<ItemTaxAmount></ItemTaxAmount>
		            <GrossAmount/>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
		            <TaxAmountInLocalCurrency/>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxCountry>
		        <SellerTaxState>
		          <TaxCalculationLineComponent>
		            <TaxAmount></TaxAmount>
					<ItemTaxAmount></ItemTaxAmount>
					<GrossAmount></GrossAmount>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
					<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxState>
		      </SellerTax>
			  <BuyerTax>
				<BuyerTaxCountry>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxCountry>
				<BuyerTaxState>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxState>
			</BuyerTax>
      <VariableTaxSteeringInput>

        <ConsignorCountry/>
        <ConsignorState/>

        <ConsignorBusinessUnitCode/>

        <ConsignorBusinessUnitType/>

        <ConsigneeCountry/>

        <ConsigneeState/>

        <ConsigneeBusinessUnitCode/>

        <ConsigneeBusinessUnitType/>

        <CarrierCountry/>

        <CarrierState/>

        <CarrierBusinessUnitCode/>

        <CarrierBusinessUnitType/>

        <ShipmentStartCountry/>

        <ShipmentEndCountry/>

        <ShipmentStartState/>

        <ShipmentEndState/>

        <ServiceRenderedCountry/>

        <ServiceRenderedState/>

        <ResalePurpose/>

        <IsOutBonded/>

        <IsInBonded/>

        <TaxPreAlgorithmOutput>

          <IsExport/>

          <IsImport/>

          <IsExported/>

          <IsImported/>

        </TaxPreAlgorithmOutput>

        <ShippingOfCustomsClearedGoods/>

      </VariableTaxSteeringInput>
    </TaxInvoiceLine>
    <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>2</ItemNo>
      <ItemType/>
      <UNSPSC>10203000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.127</NetAmount>
     <ItemNetAmount></ItemNetAmount>
			  <GrossAmount></GrossAmount>
			  <ItemGrossAmount></ItemGrossAmount>
			  <Quantity></Quantity>
		      <SellerTax>
		        <SellerTaxCountry>
		          <TaxCalculationLineComponent>
		            <TaxAmount/>
					<ItemTaxAmount></ItemTaxAmount>
		            <GrossAmount/>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
		            <TaxAmountInLocalCurrency/>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxCountry>
		        <SellerTaxState>
		          <TaxCalculationLineComponent>
		            <TaxAmount></TaxAmount>
					<ItemTaxAmount></ItemTaxAmount>
					<GrossAmount></GrossAmount>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
					<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxState>
		      </SellerTax>
			  <BuyerTax>
				<BuyerTaxCountry>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxCountry>
				<BuyerTaxState>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxState>
			</BuyerTax>
       <VariableTaxSteeringInput>

        <ConsignorCountry/>
        <ConsignorState/>

        <ConsignorBusinessUnitCode/>

        <ConsignorBusinessUnitType/>

        <ConsigneeCountry/>

        <ConsigneeState/>

        <ConsigneeBusinessUnitCode/>

        <ConsigneeBusinessUnitType/>

        <CarrierCountry/>

        <CarrierState/>

        <CarrierBusinessUnitCode/>

        <CarrierBusinessUnitType/>

        <ShipmentStartCountry/>

        <ShipmentEndCountry/>

        <ShipmentStartState/>

        <ShipmentEndState/>

        <ServiceRenderedCountry/>

        <ServiceRenderedState/>

        <ResalePurpose/>

        <IsOutBonded/>

        <IsInBonded/>

        <TaxPreAlgorithmOutput>

          <IsExport/>

          <IsImport/>

          <IsExported/>

          <IsImported/>

        </TaxPreAlgorithmOutput>

        <ShippingOfCustomsClearedGoods/>

      </VariableTaxSteeringInput>
    </TaxInvoiceLine>
    <SellerTaxInformation>
       <TaxRegistration>

        <TaxRegistrationCountry/>

        <TaxRegistrationNumberType/>

        <TaxRegistrationNumber/>

        <TaxRegistrationState/>

        <TaxRegistrationNumberStateType/>

        <TaxRegistrationNumberState/>

      </TaxRegistration>
      <TaxRepresentative>
        <TaxParty>
           <TaxRepresentativeCode/>

           <TaxRepresentativeType/>

           <BusinessUnitCode/>

           <BusinessUnitType/>

           <BusinessUnitName/>
        </TaxParty>
        <TaxRegistration>

        <TaxRegistrationCountry/>

        <TaxRegistrationNumberType/>

        <TaxRegistrationNumber/>

        <TaxRegistrationState/>

        <TaxRegistrationNumberStateType/>

        <TaxRegistrationNumberState/>

      </TaxRegistration>
        <PartyAddress>
           <AddressType/>

           <City/>

           <PostBox/>

           <Street/>

           <ZipCode/>

           <CountryCode/>

           <StateCode/>

           <CountryOfLegalRegistration/>
        </PartyAddress>
      </TaxRepresentative>
    </SellerTaxInformation>
    <BuyerTaxInformation>
      <TaxRegistration>

        <TaxRegistrationCountry/>

        <TaxRegistrationNumberType/>

        <TaxRegistrationNumber/>

        <TaxRegistrationState/>

        <TaxRegistrationNumberStateType/>

        <TaxRegistrationNumberState/>

      </TaxRegistration>
      <TaxRepresentative>
        <TaxParty>
           <TaxRepresentativeCode/>

           <TaxRepresentativeType/>

           <BusinessUnitCode/>

           <BusinessUnitType/>

           <BusinessUnitName/>
        </TaxParty>
        <TaxRegistration>

        <TaxRegistrationCountry/>

        <TaxRegistrationNumberType/>

        <TaxRegistrationNumber/>

        <TaxRegistrationState/>

        <TaxRegistrationNumberStateType/>

        <TaxRegistrationNumberState/>

      </TaxRegistration>
        <PartyAddress>
           <AddressType/>

           <City/>

           <PostBox/>

           <Street/>

           <ZipCode/>

           <CountryCode/>

           <StateCode/>

           <CountryOfLegalRegistration/>
        </PartyAddress>
      </TaxRepresentative>
    </BuyerTaxInformation>
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2014-03-03</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>N</SkipDecision>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry>CA</ConsignorCountry>
    <ConsignorState>CAON</ConsignorState>
    <ConsignorBusinessUnitCode>5100</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>4960</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose>N</ResalePurpose>
    <IsOutBonded>N</IsOutBonded>
    <IsInBonded>N</IsInBonded>
    <TaxPreAlgorithmOutput>
      <IsExport>Y</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>4960</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
	<CustomerID></CustomerID>
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>5100</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
  </SellerParty>
<TermOfDelivery>DDU</TermOfDelivery></arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>